Обработки/Reports/_ВыгрузкаПартийДляСНГ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ВыгрузкаПартийДляСНГ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ВыгрузкаПартийДляСНГ/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, 
		"Выгрузка партий для СНГ", 
		"0.13", 
		"", 
		Истина);
		
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
		
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	Настройки = КомпоновщикНастроек.Настройки;
	
	
	МассивВД = Новый Массив;
	МассивВД.Добавить(Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии);
	МассивВД.Добавить(Справочники.ВидыЗадолженности.ПоТорговойКомиссии);
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОтчетнаяДата", Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ЭтотОбъект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", Дата(1812,9,7));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидЗадолженности", МассивВД);
	
	
	//ДанныеШапки = ПолучитьДанныеШапки();
	//Если НЕ ДанныеШапки = Неопределено Тогда
	//
	//	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаДоговора", 				Формат(ДанныеШапки.ДатаДоговора, "ДФ=dd.MM.yyyy"));
	//	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НомерДоговора", 				ДанныеШапки.НомерДоговора);
	//		
	//КонецЕсли; 
	//		
	//СтруктураДанныхКонтактногоЛица = Неопределено;
	//КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	//
	//ПараметрыВыводаПодписей = Новый Структура;
	//ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	//ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	//
	//Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	//
	//	ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
	//	ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
	//	ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	//
	//КонецЕсли; 
	//
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект,ДокументРезультат,ДанныеРасшифровки,СтандартнаяОбработка,);

КонецПроцедуры
